# IS 362 Project 1

**Question 2 : Read the information from your .CSV file into pandas, and perform  analysis to compare the arrival delays for the two airlines.**

In [1]:
#Firstly we need to import pandas
import pandas as pd

In [2]:
#Next we need to write a .read_csv() command to retrieve the data within the CSV file
flightdata = pd.read_csv(r'C:\Users\Koowii\Desktop\project1.csv')

In [3]:
#Now we can use the .head() command to retrieve the first five rows of the CSV file
flightdata.head()

   Unnamed: 0    Destination  AlaskaOT  AlaskaD  AMWestOT  AMWestD
0           0    Los Angeles       497       62       694      117
1           1        Phoenix       221       12      4840      415
2           2      San Diego       212       20       383       65
3           3  San Francisco       503      102       320      129
4           4        Seattle      1841      305       201       61

*Displayed above is a table that has all the flight delay (D) and on time (OT) information*

In [4]:
#Next we will use the .insert() command to add two new colums to our dataset
flightdata.insert(3, 'AlaskaTotalFlights', flightdata.AlaskaOT + flightdata.AlaskaD)
flightdata.insert(7, 'AMWestTotalFlights', flightdata.AMWestOT + flightdata.AMWestD)

In [5]:
#To view the updated table we will simply type
flightdata

,Unnamed: 0,Destination,AlaskaOT,AlaskaTotalFlights,AlaskaD,AMWestOT,AMWestD,AMWestTotalFlights
0,0,Los Angeles,497,559,62,694,117,811
1,1,Phoenix,221,233,12,4840,415,5255
2,2,San Diego,212,232,20,383,65,448
3,3,San Francisco,503,605,102,320,129,449
4,4,Seattle,1841,2146,305,201,61,262

*Displayed above is the updated table with total flights listed, we can use this variable to calculate the rate of flight delays, for each airline.*

In [10]:
#We will insert two new columns for the flight delay rate (DR) data using the code below:
flightdata.insert(4, 'AlaskaDR', (flightdata.AlaskaD / flightdata.AlaskaTotalFlights) * 100)
flightdata.insert(8, 'AMWestDR', (flightdata.AMWestD / flightdata.AMWestTotalFlights) * 100)

ValueError: cannot insert AlaskaDR, already exists

In [7]:
#Again, to view the updated table we simply type
flightdata

,Unnamed: 0,Destination,AlaskaOT,AlaskaTotalFlights,AlaskaDR,AlaskaD,AMWestOT,AMWestD,AMWestDR,AMWestTotalFlights
0,0,Los Angeles,497,559,11.091234,62,694,117,14.426634,811
1,1,Phoenix,221,233,5.150215,12,4840,415,7.897241,5255
2,2,San Diego,212,232,8.620690,20,383,65,14.508929,448
3,3,San Francisco,503,605,16.859504,102,320,129,28.730512,449
4,4,Seattle,1841,2146,14.212488,305,201,61,23.282443,262

*The table above now shows us the delay rates for both airlines*

In [8]:
#We can take a closer look at the delay rate (DR) information by eliminating the other columms
DR = flightdata[['Destination', 'AlaskaDR', 'AMWestDR']]
DR

     Destination   AlaskaDR   AMWestDR
0    Los Angeles  11.091234  14.426634
1        Phoenix   5.150215   7.897241
2      San Diego   8.620690  14.508929
3  San Francisco  16.859504  28.730512
4        Seattle  14.212488  23.282443

# Conclusion
When we analyse the data side by side it becomes clear that AMWest Airlines has a much higher delay rate than Alaska Airlines.